    #!/bin/bash
    set -e
    

    for service_dir in services/*; do
      if [ -d "$service_dir" ]; then
        echo "======================================================================"
        echo ">>> Запуск тестов для сервиса: ${service_dir}..."
        echo "======================================================================"
        
        (cd "$service_dir" && uv run --with ".[dev]" pytest)
        
        echo ">>> Тесты для ${service_dir} успешно завершены."
        echo ""
      fi
    done
    
    echo "======================================================================"
    echo "✅ Все тесты успешно пройдены!"
    echo "======================================================================"